## GTFS
In order to compute accessibility based on GTFS data (General Transit Feed Specification, can by downloaded from ftp://199.203.58.18/), we will first perform basic processing of the data.
We are using the pandas library.

The code is based on the following structure of GTFS tables:
![GTFS Tables](../../input_data/GTFS_tables.PNG)

In [97]:
import pandas as pd
import datetime as dt
import pickle
from tqdm.auto import tqdm
tqdm.pandas()

DATA_PATH = '../../../input_data/synthetic_examples/input_data/Test0_b_TwoLines/'

In [98]:
OUTPUT_PATH = '../../../output_data/validation/two_lines/'

In [99]:
DAY = dt.datetime(2015, 12, 14)

## Process Calendar - Get trips for a single day

In [100]:
# Load calendar
calendar_df = pd.read_csv(DATA_PATH + 'calendar.txt')
# Convert dates to python's datetime type
calendar_df['start_date'] = calendar_df['start_date'].apply(lambda x: dt.datetime.strptime(str(x), '%Y%m%d'))
calendar_df['end_date'] = calendar_df['end_date'].apply(lambda x: dt.datetime.strptime(str(x), '%Y%m%d'))

calendar_df.columns = ['service_id',
 'sunday',
 'monday',
 'tuesday',
 'wednesday',
 'thursday',
 'friday',
 'saturday',
 'start_date',
 'end_date']

calendar_df[:3]

,service_id,sunday,monday,tuesday,wednesday,thursday,friday,saturday,start_date,end_date
0,31360372,1,1,1,1,1,1,1,2015-01-01,2016-12-31
1,31349568,1,1,1,1,1,1,1,2015-01-01,2016-12-31

In [101]:
# Let's say we want all trips that occurred on the first Sunday after the feed was published 

# Filter so we only keep services that are active on Sunday.
sunday_services_df = calendar_df[calendar_df['sunday'] == 1][['service_id', 'start_date', 'end_date']]

# Keep only services that start during/before selected date
sunday_services_df = sunday_services_df[sunday_services_df['start_date'] <= DAY]

# Keep only services that end during/after selected date
sunday_services_df = sunday_services_df[sunday_services_df['end_date'] >= DAY]

In [102]:
sunday_services_df

   service_id start_date   end_date
0    31360372 2015-01-01 2016-12-31
1    31349568 2015-01-01 2016-12-31

## Process Trips

In [103]:
# Load trips
trips_df = pd.read_csv(DATA_PATH + 'trips.txt')

In [104]:
trips_df.head(2)

   route_id  service_id          trip_id  direction_id  shape_id
0      9823    31360372  18854222_161215             0     64333
1      9823    31360372  18854225_161215             0     64333

In [105]:


# Fix column names (some columns have special 'hudden' characters that we want to remove)
trips_df.columns = ['route_id', 'service_id', 'trip_id', 'direction_is', 'shape_id']

trips_calendar_df = sunday_services_df.merge(trips_df, on='service_id', suffixes=('_calendar', '_trips'))
sunday_trips_df = trips_calendar_df.drop(['start_date', 'end_date'], axis=1)
sunday_trips_df[:3]

   service_id  route_id          trip_id  direction_is  shape_id
0    31360372      9823  18854222_161215             0     64333
1    31360372      9823  18854225_161215             0     64333
2    31360372      9823  18854226_161215             0     64333

In [106]:
sunday_trips_df.nunique()

service_id        2
route_id          2
trip_id         161
direction_is      1
shape_id          2
dtype: int64

### We now have all trips that occurred on the selected date

## Process Stop Times
Note: This is pretty heavy compared to the rest of the tables

In [107]:
# Load stop times
stop_times_df = pd.read_csv(DATA_PATH + 'stop_times.txt')

# Get all trips departures by getting the minimal departure time for each trip
trips_start_times_df = stop_times_df.groupby('trip_id').agg({'departure_time': 'min'})

# Let's join the last two tabled to get the departure times of all sunday trips
sunday_departures_df = sunday_trips_df.merge(trips_start_times_df, on='trip_id', suffixes=('_departures', '_trips'))

In [108]:
sunday_departures_df.head(2)

,service_id,route_id,trip_id,direction_is,shape_id,departure_time
0,31360372,9823,18854222_161215,0,64333,12:05:00
1,31360372,9823,18854225_161215,0,64333,13:35:00

## Process Stops

In [109]:
def convert_gtfs_time_to_datetime(gtfs_time):
#     date = dt.datetime(2019, 11, 3)
    h, m, s = [int(x) for x in gtfs_time.split(':')]
    if h < 24:
        # This is a 'normal' situation, we can simply create a datetime object using the date we defined before
        return DAY + dt.timedelta(hours=h, minutes=m, seconds=s)
    # Otherwise we have a 'strange' time: it's after midnight
    new_date = DAY + dt.timedelta(days=1)
    return new_date + dt.timedelta(hours=h-24, minutes=m, seconds=s)

In [110]:
# Load stops
stops_df = pd.read_csv(DATA_PATH + 'stops.txt')

stops_df.head(2)

,stop_id,stop_code,stop_name,stop_desc,stop_lat,stop_lon,location_type,parent_station
0,775,39739,ההסתדרות/שנקר,רחוב:ההסתדרות 54 עיר: חולון רציף: קומה:,32.017504,34.774177,0,NaN
1,12882,21128,אבן גבירול/שד' נורדאו,רחוב:אבן גבירול 155 עיר: תל אביב יפו רציף: ...,32.091212,34.782786,0,NaN

In [111]:
# Add stop code and zone id to stop times
stop_times_with_stop_codes_df = stop_times_df.merge(
    stops_df[['stop_id', 'stop_code']], on='stop_id')

stop_times_with_stop_codes_df['departure_time'] = stop_times_with_stop_codes_df[
    'departure_time'].apply(convert_gtfs_time_to_datetime)

## Construct Nodes

In [112]:
# We want to (right) join this table with stop_times in order to get the sunday stop times with trip departure time.
sunday_nodes_df = stop_times_df.merge(sunday_departures_df, how='right', on='trip_id', suffixes=('_stop', '_trip_departure'))

# Remove some columns to clear the data
sunday_nodes_df = sunday_nodes_df.drop(['pickup_type',
                                        'drop_off_type', 'service_id', 'direction_is', 'shape_id'], 
                                       axis=1)

# Add stops data to nodes
nodes_df = sunday_nodes_df.merge(stops_df, on='stop_id', suffixes=('_node', '_stop'))
nodes_df = nodes_df.drop(['stop_desc', 'stop_name', 'parent_station', 'location_type'],axis=1)


nodes_df[:3]

,trip_id,arrival_time,departure_time_stop,stop_id,stop_sequence,route_id,departure_time_trip_departure,stop_code,stop_lat,stop_lon
0,18854219_161215,11:02:48,11:02:48,13257,30,9823,10:20:00,22557,32.040172,34.775255
1,18854222_161215,12:47:48,12:47:48,13257,30,9823,12:05:00,22557,32.040172,34.775255
2,18854225_161215,14:17:48,14:17:48,13257,30,9823,13:35:00,22557,32.040172,34.775255

In [113]:
# Convert GTFS times to match "real-world time".
nodes_df['arrival'] = nodes_df['arrival_time'].apply(convert_gtfs_time_to_datetime)
nodes_df['departure'] = nodes_df['departure_time_stop'].apply(convert_gtfs_time_to_datetime)

In [114]:
nodes_df.head()

,trip_id,arrival_time,departure_time_stop,stop_id,stop_sequence,route_id,departure_time_trip_departure,stop_code,stop_lat,stop_lon,arrival,departure
0,18854219_161215,11:02:48,11:02:48,13257,30,9823,10:20:00,22557,32.040172,34.775255,2015-12-14 11:02:48,2015-12-14 11:02:48
1,18854222_161215,12:47:48,12:47:48,13257,30,9823,12:05:00,22557,32.040172,34.775255,2015-12-14 12:47:48,2015-12-14 12:47:48
2,18854225_161215,14:17:48,14:17:48,13257,30,9823,13:35:00,22557,32.040172,34.775255,2015-12-14 14:17:48,2015-12-14 14:17:48
3,18854226_161215,14:44:48,14:44:48,13257,30,9823,14:02:00,22557,32.040172,34.775255,2015-12-14 14:44:48,2015-12-14 14:44:48
4,18854227_161215,14:56:48,14:56:48,13257,30,9823,14:14:00,22557,32.040172,34.775255,2015-12-14 14:56:48,2015-12-14 14:56:48

In [115]:
nodes_df.shape

(6207, 12)

## Some Stats on the Overall Nodes For the Day

In [116]:
nodes_df.nunique()

trip_id                           161
arrival_time                     5975
departure_time_stop              5975
stop_id                            80
stop_sequence                      50
route_id                            2
departure_time_trip_departure     155
stop_code                          80
stop_lat                           80
stop_lon                           80
arrival                          5975
departure                        5975
dtype: int64

In [117]:
# TODO: add node_id according to index, and save in pkl

In [118]:
nodes_df.to_pickle(OUTPUT_PATH + 'all_nodes.pkl')

In [119]:
nodes_df[nodes_df['arrival'] > start_time].sort_values('arrival')

,trip_id,arrival_time,departure_time_stop,stop_id,stop_sequence,route_id,departure_time_trip_departure,stop_code,stop_lat,stop_lon,arrival,departure
1494,18854212_161215,07:00:01,07:00:01,29568,7,9823,06:53:00,20482,32.117333,34.806280,2015-12-14 07:00:01,2015-12-14 07:00:01
2303,18854384_161215,07:00:13,07:00:13,29488,19,9823,06:35:00,20361,32.075101,34.781570,2015-12-14 07:00:13,2015-12-14 07:00:13
1558,18854212_161215,07:00:32,07:00:32,13229,8,9823,06:53:00,21734,32.115503,34.807217,2015-12-14 07:00:32,2015-12-14 07:00:32
5527,19283213_161215,07:00:34,07:00:34,13821,15,2517,06:40:00,26099,32.073809,34.800651,2015-12-14 07:00:34,2015-12-14 07:00:34
85,18854211_161215,07:00:37,07:00:37,13428,31,9823,06:15:00,25273,32.037780,34.777806,2015-12-14 07:00:37,2015-12-14 07:00:37
4840,19283214_161215,07:00:46,07:00:46,13584,7,2517,06:50:00,25612,32.072437,34.778119,2015-12-14 07:00:46,2015-12-14 07:00:46
1622,18854212_161215,07:01:00,07:01:00,29398,9,9823,06:53:00,20137,32.113547,34.807402,2015-12-14 07:01:00,2015-12-14 07:01:00
3442,19283212_161215,07:01:06,07:01:06,13896,24,2517,06:30:00,26207,32.072195,34.822999,2015-12-14 07:01:06,2015-12-14 07:01:06
2367,18854384_161215,07:01:20,07:01:20,14530,20,9823,06:35:00,28561,32.071828,34.781736,2015-12-14 07:01:20,2015-12-14 07:01:20
4937,19283214_161215,07:01:24,07:01:24,13575,8,2517,06:50:00,25592,32.071428,34.778882,2015-12-14 07:01:24,2015-12-14 07:01:24
1686,18854212_161215,07:01:54,07:01:54,13359,10,9823,06:53:00,25075,32.109767,34.807047,2015-12-14 07:01:54,2015-12-14 07:01:54
5624,19283213_161215,07:02:13,07:02:13,13814,16,2517,06:40:00,26091,32.070515,34.802564,2015-12-14 07:02:13,2015-12-14 07:02:13
5034,19283214_161215,07:02:30,07:02:30,13578,9,2517,06:50:00,25600,32.069956,34.780692,2015-12-14 07:02:30,2015-12-14 07:02:30
4356,19283215_161215,07:02:41,07:02:41,13488,2,2517,07:00:00,25365,32.070195,34.764907,2015-12-14 07:02:41,2015-12-14 07:02:41
3539,19283212_161215,07:02:44,07:02:44,13883,25,2517,06:30:00,26192,32.067943,34.821594,2015-12-14 07:02:44,2015-12-14 07:02:44
1750,18854212_161215,07:03:01,07:03:01,13950,11,9823,06:53:00,26315,32.106109,34.804500,2015-12-14 07:03:01,2015-12-14 07:03:01
5721,19283213_161215,07:03:12,07:03:12,13820,17,2517,06:40:00,26098,32.070466,34.807074,2015-12-14 07:03:12,2015-12-14 07:03:12
2453,18854384_161215,07:03:30,07:03:30,13226,21,9823,06:35:00,21729,32.069337,34.785356,2015-12-14 07:03:30,2015-12-14 07:03:30
3636,19283212_161215,07:03:53,07:03:53,13878,26,2517,06:30:00,26187,32.064679,34.820442,2015-12-14 07:03:53,2015-12-14 07:03:53
2520,19283214_161215,07:04:05,07:04:05,13226,10,2517,06:50:00,21729,32.069337,34.785356,2015-12-14 07:04:05,2015-12-14 07:04:05
5818,19283213_161215,07:04:08,07:04:08,12844,18,2517,06:40:00,21076,32.072340,34.808682,2015-12-14 07:04:08,2015-12-14 07:04:08
4453,19283215_161215,07:04:24,07:04:24,13551,3,2517,07:00:00,25532,32.072992,34.767491,2015-12-14 07:04:24,2015-12-14 07:04:24
5915,19283213_161215,07:04:31,07:04:31,12843,19,2517,06:40:00,21075,32.073858,34.808646,2015-12-14 07:04:31,2015-12-14 07:04:31
3733,19283212_161215,07:05:25,07:05:25,13879,27,2517,06:30:00,26188,32.063607,34.823418,2015-12-14 07:05:25,2015-12-14 07:05:25
149,18854211_161215,07:05:45,07:05:45,21520,32,9823,06:15:00,33347,32.027036,34.773495,2015-12-14 07:05:45,2015-12-14 07:05:45
6012,19283213_161215,07:05:56,07:05:56,13836,20,2517,06:40:00,26130,32.075624,34.810752,2015-12-14 07:05:56,2015-12-14 07:05:56
2592,18854384_161215,07:06:05,07:06:05,38950,22,9823,06:35:00,20007,32.065658,34.783132,2015-12-14 07:06:05,2015-12-14 07:06:05
5131,19283214_161215,07:06:11,07:06:11,12932,11,2517,06:50:00,21221,32.071436,34.789770,2015-12-14 07:06:11,2015-12-14 07:06:11
3830,19283212_161215,07:06:15,07:06:15,13863,28,2517,06:30:00,26166,32.061997,34.821969,2015-12-14 07:06:15,2015-12-14 07:06:15
4550,19283215_161215,07:06:37,07:06:37,13314,4,2517,07:00:00,23006,32.076828,34.768304,2015-12-14 07:06:37,2015-12-14 07:06:37
...,...,...,...,...,...,...,...,...,...,...,...,...
5553,19283304_161215,24:02:13,24:02:13,13814,16,2517,23:40:00,26091,32.070515,34.802564,2015-12-15 00:02:13,2015-12-15 00:02:13
531,18854242_161215,24:02:36,24:02:36,24150,38,9823,23:05:00,36386,32.016941,34.781151,2015-12-15 00:02:36,2015-12-15 00:02:36
5650,19283304_161215,24:03:12,24:03:12,13820,17,2517,23:40:00,26098,32.070466,34.807074,2015-12-15 00:03:12,2015-12-15 00:03:12
4097,19283303_161215,24:03:20,24:03:20,12867,31,2517,23:20:00,21109,32.055035,34.833911,2015-12-15 00:03:20,2015-12-15 00:03:20
595,18854242_161215,24:03:59,24:03:59,21866,39,9823,23:05:00,33817,32.015994,34.784738,2015-12-15 00:03:59,2015-12-15 00:03:59
5747,19283304_161215,24:04:08,24:04:08,12844,18,2517,23:40:00,21076,32.072340,34.808682,2015-12-15 00:04:08,2015-12-15 00:04:08
659,18854242_161215,24:04:30,24:04:30,21416,40,9823,23:05:00,33224,32.017610,34.786839,2015-12-15 00:04:30,2015-12-15 00:04:30
5844,19283304_161215,24:04:31,24:04:31,12843,19,2517,23:40:00,21075,32.073858,34.808646,2015-12-15 00:04:31,2015-12-15 00:04:31
5941,19283304_161215,24:05:56,24:05:56,13836,20,2517,23:40:00,26130,32.075624,34.810752,2015-12-15 00:05:56,2015-12-15 00:05:56
723,18854242_161215,24:05:58,24:05:58,22413,41,9823,23:05:00,34384,32.019303,34.790157,2015-12-15 00:05:58,2015-12-15 00:05:58
787,18854242_161215,24:06:33,24:06:33,22819,42,9823,23:05:00,34797,32.019719,34.792113,2015-12-15 00:06:33,2015-12-15 00:06:33
851,18854242_161215,24:07:32,24:07:32,21817,43,9823,23:05:00,33764,32.018187,34.793877,2015-12-15 00:07:32,2015-12-15 00:07:32
6038,19283304_161215,24:07:35,24:07:35,13839,21,2517,23:40:00,26135,32.076939,34.815080,2015-12-15 00:07:35,2015-12-15 00:07:35
6135,19283304_161215,24:08:11,24:08:11,13886,22,2517,23:40:00,26196,32.075329,34.817500,2015-12-15 00:08:11,2015-12-15 00:08:11
915,18854242_161215,24:08:13,24:08:13,23729,44,9823,23:05:00,35881,32.017376,34.795814,2015-12-15 00:08:13,2015-12-15 00:08:13
979,18854242_161215,24:09:00,24:09:00,21812,45,9823,23:05:00,33759,32.016885,34.797698,2015-12-15 00:09:00,2015-12-15 00:09:00
3322,19283304_161215,24:09:37,24:09:37,13894,23,2517,23:40:00,26205,32.074615,34.821709,2015-12-15 00:09:37,2015-12-15 00:09:37
1043,18854242_161215,24:10:51,24:10:51,24177,46,9823,23:05:00,36419,32.016004,34.800993,2015-12-15 00:10:51,2015-12-15 00:10:51
3419,19283304_161215,24:11:06,24:11:06,13896,24,2517,23:40:00,26207,32.072195,34.822999,2015-12-15 00:11:06,2015-12-15 00:11:06
3516,19283304_161215,24:12:44,24:12:44,13883,25,2517,23:40:00,26192,32.067943,34.821594,2015-12-15 00:12:44,2015-12-15 00:12:44
1107,18854242_161215,24:13:02,24:13:02,21821,47,9823,23:05:00,33768,32.020222,34.804685,2015-12-15 00:13:02,2015-12-15 00:13:02
1171,18854242_161215,24:13:46,24:13:46,15564,48,9823,23:05:00,31252,32.021799,34.805505,2015-12-15 00:13:46,2015-12-15 00:13:46
3613,19283304_161215,24:13:53,24:13:53,13878,26,2517,23:40:00,26187,32.064679,34.820442,2015-12-15 00:13:53,2015-12-15 00:13:53
1235,18854242_161215,24:14:44,24:14:44,21475,49,9823,23:05:00,33287,32.024450,34.802347,2015-12-15 00:14:44,2015-12-15 00:14:44
3710,19283304_161215,24:15:25,24:15:25,13879,27,2517,23:40:00,26188,32.063607,34.823418,2015-12-15 00:15:25,2015-12-15 00:15:25
3807,19283304_161215,24:16:15,24:16:15,13863,28,2517,23:40:00,26166,32.061997,34.821969,2015-12-15 00:16:15,2015-12-15 00:16:15
1299,18854242_161215,24:17:33,24:17:33,24165,50,9823,23:05:00,36404,32.025734,34.797185,2015-12-15 00:17:33,2015-12-15 00:17:33
3904,19283304_161215,24:18:16,24:18:16,12816,29,2517,23:40:00,21002,32.059675,34.821988,2015-12-15 00:18:16,2015-12-15 00:18:16
4001,19283304_161215,24:20:23,24:20:23,12837,30,2517,23:40:00,21041,32.058354,34.828604,2015-12-15 00:20:23,2015-12-15 00:20:23
4098,19283304_161215,24:23:20,24:23:20,12867,31,2517,23:40:00,21109,32.055035,34.833911,2015-12-15 00:23:20,2015-12-15 00:23:20

In [120]:
start_time = DAY + dt.timedelta(hours=7)
end_time = start_time + dt.timedelta(hours=1, minutes=30)

morning_nodes_df = nodes_df[nodes_df['arrival'] > start_time][nodes_df['arrival'] < end_time]
morning_nodes_df.head(3)

d:\users\bensdani\venvs\lib\site-packages\ipykernel_launcher.py:4: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  after removing the cwd from sys.path.

,trip_id,arrival_time,departure_time_stop,stop_id,stop_sequence,route_id,departure_time_trip_departure,stop_code,stop_lat,stop_lon,arrival,departure
22,18854212_161215,07:35:48,07:35:48,13257,30,9823,06:53:00,22557,32.040172,34.775255,2015-12-14 07:35:48,2015-12-14 07:35:48
40,18854213_161215,07:52:48,07:52:48,13257,30,9823,07:10:00,22557,32.040172,34.775255,2015-12-14 07:52:48,2015-12-14 07:52:48
41,18854214_161215,08:22:48,08:22:48,13257,30,9823,07:40:00,22557,32.040172,34.775255,2015-12-14 08:22:48,2015-12-14 08:22:48

In [121]:
morning_nodes_df.nunique()

trip_id                           22
arrival_time                     533
departure_time_stop              533
stop_id                           80
stop_sequence                     50
route_id                           2
departure_time_trip_departure     21
stop_code                         80
stop_lat                          80
stop_lon                          80
arrival                          533
departure                        533
dtype: int64

In [122]:
morning_nodes_df = morning_nodes_df.reset_index()

In [123]:
morning_nodes_df['node_id'] = morning_nodes_df.index

In [124]:
morning_nodes_df.head(3)

,index,trip_id,arrival_time,departure_time_stop,stop_id,stop_sequence,route_id,departure_time_trip_departure,stop_code,stop_lat,stop_lon,arrival,departure,node_id
0,22,18854212_161215,07:35:48,07:35:48,13257,30,9823,06:53:00,22557,32.040172,34.775255,2015-12-14 07:35:48,2015-12-14 07:35:48,0
1,40,18854213_161215,07:52:48,07:52:48,13257,30,9823,07:10:00,22557,32.040172,34.775255,2015-12-14 07:52:48,2015-12-14 07:52:48,1
2,41,18854214_161215,08:22:48,08:22:48,13257,30,9823,07:40:00,22557,32.040172,34.775255,2015-12-14 08:22:48,2015-12-14 08:22:48,2

In [125]:
morning_nodes_df.to_pickle(OUTPUT_PATH + 'morning_nodes.pkl')

## Filter only Tel Aviv Metropolitan stops

Let's get all Tel Aviv (TLV) stops

In [ ]:
for zone in stops_df['zone_id'].unique():
    print(zone)

In [ ]:
test_stops = stops_df[stops_df['zone_id'] == 6900]
test_stops.to_csv(OUTPUT_PATH + 'test_stops.csv')

In [ ]:
test_stops.shape

In [ ]:
stops_df.shape

In [ ]:
# Let's see how manu NaN zones we have:
stops_df['zone_id'].isna().sum()

In [ ]:
# I think zone 210 is tel aviv metropolitan area (only the small surrounding part, we would need to extend for our real computations). 
# We need to filter only trips that contain stops (and then only nodes with those stops) that are in this zone.
tlv_stops_df = stops_df[stops_df['zone_id'] == 210]

In [ ]:
tlv_stops_df.shape

Now we need to get the TLV stop times, in order to find all trips that include TLV stops

In [ ]:
# stop_times_df
tlv_stop_times_df = stop_times_df.merge(tlv_stops_df[['stop_id']], on='stop_id', how='inner')

In [ ]:
tlv_stop_times_df.shape

In [ ]:
stop_times_df.shape

Next, the TLV stop times include all actual trip ids with TLV stops in them. Let's find relevant trip in the Sunday's trips we're examining

In [ ]:
# !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#
# We want to get unique trips which pass through TLV, then we will use these trips to filter 
# only nodes that pass through TLV.
#
# !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

tlv_trips_df = tlv_stop_times_df[['trip_id']].drop_duplicates(subset ="trip_id", 
                     keep = False, inplace = False)

In [ ]:
tlv_trips_df.head()

In [ ]:
tlv_trips_df.shape

Finally, let's save only nodes that include TLV trips

In [ ]:
tlv_nodes_df = nodes_df.merge(tlv_trips_df[['trip_id']], on='trip_id', how='inner')

In [ ]:
nodes_df.shape

In [ ]:
tlv_nodes_df.shape

In [ ]:
tlv_nodes_df.to_csv('tlv_nodes.csv')